[M_Sage_RareSpawns MissionDefinition]
MissionName="It is rarely prepared"
MissionDescription="A hunter named Bloodlust, who doesn't seem like a bad guy, protects you by hunting rare animals. There is no telling when or where these creatures will appear, so be on the lookout and keep your weapons loaded.."
TurnInDescription="By killing these hungry animals, you will create your image as a gun reporter. A bed!"
MissionSummary="Defeat unique, randomly generated killer creatures.."
MissionGiver="Hunting Cave sign"
MissionTurnInLocation="Hunter's Grotto Prize Fund"
TeaserText="Start the hunt..."

[M_Sage_RareSpawns:KillBoroks MissionObjectiveDefinition]
ProgressMessage="Kill the pink cow"

[M_Sage_RareSpawns:KillDrifters MissionObjectiveDefinition]
ProgressMessage="The two-legged killer"

[M_Sage_RareSpawns:KillScaylions MissionObjectiveDefinition]
ProgressMessage="Killer without a tail"

[M_Sage_RareSpawns:KillSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_RareSpawns:KillSkags MissionObjectiveDefinition]
ProgressMessage="Kill the albino bones"

[M_Sage_RareSpawns:KillSpores MissionObjectiveDefinition]
ProgressMessage="Kill the mantle snail."

